      *COPY DE COMUNICACAO PROGRAMA HBSIS007P
       01  HBSIS007L.
           05  COD-RETORNO-HBSIS007L   PIC  9(001)         VALUE ZEROS.
           05  MSG-RETORNO-HBSIS007L   PIC  X(050)         VALUE SPACES.

            


