      *COPY DE COMUNICACAO PROGRAMA HBSIS008P
       01  HBSIS008L.
           05  COD-RETORNO-HBSIS008L   PIC  9(001)         VALUE ZEROS.
           05  MSG-RETORNO-HBSIS008L   PIC  X(050)         VALUE SPACES.


